CSI API ETABS v1
cPropFrame.GetCoverPlatedI Method
 retrieves frame section property data for a cover plated I-type frame section.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetCoverPlatedI(
	string Name,
	ref string SectName,
	ref double FyTopFlange,
	ref double FyWeb,
	ref double FyBotFlange,
	ref double Tc,
	ref double Bc,
	ref string MatPropTop,
	ref double Tcb,
	ref double Bcb,
	ref string MatPropBot,
	ref int Color,
	ref string Notes,
	ref string GUID
)
Function GetCoverPlatedI (
	Name As String,
	ByRef SectName As String,
	ByRef FyTopFlange As Double,
	ByRef FyWeb As Double,
	ByRef FyBotFlange As Double,
	ByRef Tc As Double,
	ByRef Bc As Double,
	ByRef MatPropTop As String,
	ByRef Tcb As Double,
	ByRef Bcb As Double,
	ByRef MatPropBot As String,
	ByRef Color As Integer,
	ByRef Notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim SectName As String
Dim FyTopFlange As Double
Dim FyWeb As Double
Dim FyBotFlange As Double
Dim Tc As Double
Dim Bc As Double
Dim MatPropTop As String
Dim Tcb As Double
Dim Bcb As Double
Dim MatPropBot As String
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetCoverPlatedI(Name,
	SectName, FyTopFlange, FyWeb, FyBotFlange,
	Tc, Bc, MatPropTop, Tcb, Bcb, MatPropBot,
	Color, Notes, GUID)
int GetCoverPlatedI(
	String^ Name,
	String^% SectName,
	double% FyTopFlange,
	double% FyWeb,
	double% FyBotFlange,
	double% Tc,
	double% Bc,
	String^% MatPropTop,
	double% Tcb,
	double% Bcb,
	String^% MatPropBot,
	int% Color,
	String^% Notes,
	String^% GUID
)
abstract GetCoverPlatedI :
        Name : string *
        SectName : string byref *
        FyTopFlange : float byref *
        FyWeb : float byref *
        FyBotFlange : float byref *
        Tc : float byref *
        Bc : float byref *
        MatPropTop : string byref *
        Tcb : float byref *
        Bcb : float byref *
        MatPropBot : string byref *
        Color : int byref *
        Notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
The name of an existing frame section property.
SectName
Type: System.String
FyTopFlange
Type: System.Double
The yield strength of the top flange of the I-section. [F/L2]
If this item is 0, the yield strength of the I-section specified by the SectName item is used.
FyWeb
Type: System.Double
The yield strength of the web of the I-section. [F/L2]
If this item is 0, the yield strength of the I-section specified by the SectName item is used.
FyBotFlange
Type: System.Double
The yield strength of the bottom flange of the I-section. [F/L2]
If this item is 0, the yield strength of the I-section specified by the SectName item is used.
Tc
Type: System.Double
The thickness of the top cover plate. [L]
If the Tc or the Bc item is less than or equal to 0, no top cover plate exists.
Bc
Type: System.Double
The width of the top cover plate. [L]
If the Tc or the Bc item is less than or equal to 0, no top cover plate exists.
MatPropTop
Type: System.String
The name of the material property for the bottom cover plate.
This item applies only if both the Tcb and the Bcb items are greater than 0.
Tcb
Type: System.Double
The thickness of the bottom cover plate. [L]
If the Tcb or the Bcb item is less than or equal to 0, no bottom cover plate exists.
Bcb
Type: System.Double
The width of the bottom cover plate. [L]
If the Tcb or the Bcb item is less than or equal to 0, no bottom cover plate exists.
MatPropBot
Type: System.String
The name of the material property for the bottom cover plate.
This item applies only if both the Tcb and the Bcb items are greater than 0.
Color
Type: System.Int32
The display color assigned to the section. If Color is specified as -1, the program will automatically assign a color.
Notes
Type: System.String
The notes, if any, assigned to the section.
GUID
Type: System.String
The GUID (global unique identifier), if any, assigned to the section.
Return Value
Type: Int32
Returns zero if the section property is successfully initialized; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim SectName As String
       Dim FyTopFlange As Double
       Dim FyWeb As Double
       Dim FyBotFlange As Double
       Dim tc As Double
       Dim bc As Double
       Dim MatPropTop As String
       Dim tcb As Double
       Dim bcb As Double
       Dim MatPropBot As String
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new I-type frame section property
       ret = SapModel.PropFrame.SetISection("ISEC", "A992Fy50", 24, 8, 0.5, 0.3, 8, 0.5)
   'set new cover plated I-type frame section property
       ret = SapModel.PropFrame.SetCoverPlatedI("CPI1", "ISEC", 0, 36, 0, 0.75, 14, "A992Fy50", 0.5, 6, "A992Fy50")
   'get frame section property data for cover plated I
       ret = SapModel.PropFrame.GetCoverPlatedI("CPI1", SectName, FyTopFlange, FyWeb, FyBotFlange, tc, bc, MatPropTop, tcb, bcb, MatPropBot, Color, Notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace